In [1]:
import pandas as pd
from datasets import load_dataset

# Loading dataset
dataset = load_dataset("lukebarousse/data_jobs") 
df = dataset['train'].to_pandas()

# data cleanup
df['job_posted_date'] = pd.to_datetime(df.job_posted_date)

c:\Users\ELCOT\Learn python\venv\Lib\site-packages\tqdm\auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

Describe( ) :

In [2]:
df.describe()

                     job_posted_date  salary_year_avg  salary_hour_avg
count                         785741     22003.000000     10662.000000
mean   2023-06-25 16:02:11.860248576    123286.274072        47.016598
min              2023-01-01 00:00:04     15000.000000         8.000000
25%              2023-03-20 10:05:48     90000.000000        27.500000
50%              2023-06-29 06:11:38    115000.000000        45.980000
75%              2023-09-27 01:01:16    150000.000000        61.159996
max              2023-12-31 23:59:58    960000.000000       391.000000
std                              NaN     48312.449482        21.890738

Coount( ) :

In [3]:
df.count()

job_title_short          785741
job_title                785740
job_location             784696
job_via                  785733
job_schedule_type        773074
job_work_from_home       785741
search_location          785741
job_posted_date          785741
job_no_degree_mention    785741
job_health_insurance     785741
job_country              785692
salary_rate               33067
salary_year_avg           22003
salary_hour_avg           10662
company_name             785723
job_skills               668704
job_type_skills          668704
dtype: int64

In [4]:
df[['salary_hour_avg', 'salary_year_avg']].median()

salary_hour_avg        45.98
salary_year_avg    115000.00
dtype: float64

In [5]:
df[['salary_year_avg']].min()

salary_year_avg    15000.0
dtype: float64

idxmin( ) :     returns the index of minimum value

In [6]:
index_of_min_salary = df[['salary_year_avg']].idxmin()

In [7]:
df.iloc[index_of_min_salary]

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
665729,Data Engineer,Data Engineer - Hadoop,Brazil,via LinkedIn,Full-time,False,Brazil,2023-12-09 10:05:30,True,False,Brazil,year,15000.0,NaN,Net2Source Inc.,"['java', 'python', 'oracle', 'aws', 'hadoop', ...","{'cloud': ['oracle', 'aws'], 'libraries': ['ha..."

Value_counts :

In [8]:
df['job_title_short'].value_counts()

job_title_short
Data Analyst                 196075
Data Engineer                186241
Data Scientist               172286
Business Analyst              49063
Software Engineer             44929
Senior Data Engineer          44563
Senior Data Scientist         36957
Senior Data Analyst           29216
Machine Learning Engineer     14080
Cloud Engineer                12331
Name: count, dtype: int64

Groupby :

In [12]:
df.groupby('job_title_short')['salary_year_avg'].median()

job_title_short
Business Analyst              85000.0
Cloud Engineer                90000.0
Data Analyst                  90000.0
Data Engineer                125000.0
Data Scientist               127500.0
Machine Learning Engineer    106415.0
Senior Data Analyst          111175.0
Senior Data Engineer         147500.0
Senior Data Scientist        155500.0
Software Engineer             99150.0
Name: salary_year_avg, dtype: float64

In [14]:
df.groupby(['job_title_short','job_country'])['salary_year_avg'].min()

job_title_short    job_country
Business Analyst   Afghanistan        NaN
                   Albania            NaN
                   Algeria            NaN
                   Angola             NaN
                   Argentina      63000.0
                                   ...
Software Engineer  Venezuela          NaN
                   Vietnam        28000.0
                   Yemen              NaN
                   Zambia             NaN
                   Zimbabwe           NaN
Name: salary_year_avg, Length: 1387, dtype: float64

In [19]:
df.groupby('job_title_short')[['salary_year_avg','salary_hour_avg']].agg(['min','max'])

                          salary_year_avg           salary_hour_avg
                                      min       max             min    max
job_title_short
Business Analyst                  16500.0  387460.0          10.835  132.5
Cloud Engineer                    42000.0  280000.0          18.500   91.0
Data Analyst                      25000.0  650000.0           8.000  391.0
Data Engineer                     15000.0  525000.0           8.000  184.5
Data Scientist                    27000.0  960000.0           8.000  237.5
Machine Learning Engineer         30000.0  325000.0          10.000   87.5
Senior Data Analyst               30000.0  425000.0          13.000  130.0
Senior Data Engineer              35000.0  425000.0          12.500  170.0
Senior Data Scientist             45000.0  890000.0          17.500  150.0
Software Engineer                 28000.0  375000.0          11.000  102.5